[{"model": "blog.post", "pk": 1, "fields": {"title": "Get Enough Sleep", "slug": "get-enough-sleep", "updated_on": "2022-06-02T18:05:16.969Z", "content": "Often business owners create a work-life balance by pushing their bedtime back. However, this can backfire in a major way. Poor sleep doesn’t just leave you feeling tired during the day — it can actually take years off your life. Adults need 7-9 hours of sleep every night in order to keep their bodies running at their best. \r\n\r\nThere are several things you can do to facilitate this. First, create a regular sleep schedule. As much as possible, go to bed and get up at the same time every single day. This will help your body regulate its circadian rhythm, making it easier to fall asleep and get up with time. You should also make a point to sleep in a quiet, cool, dark room. Avoid using screens such as laptops, TVs, or smart devices in bed, since the light from these screens can disrupt hormone production necessary for a good night’s sleep.", "author": 1, "created_on": "2022-06-02T18:05:16.969Z"}}, {"model": "blog.post", "pk": 2, "fields": {"title": "Eat Right", "slug": "eat-right", "updated_on": "2022-06-02T18:54:31.796Z", "content": "A healthy diet is another aspect of self-care that often falls to the wayside for business owners. After all, eating a well-balanced meal typically takes time, which is, more often than not, in relatively short supply for entrepreneurs. As a result, many business owners wind up either relying on fast food or skipping meals, neither of which supports a healthy body.  \r\n\r\nYou can avoid this problem by dedicating one day a week to meal prepping. This is a system in which you spend one day cooking and preparing everything you need to eat fast, healthy meals throughout the week. There are tons of programs out there dedicated to helping people figure out how to meal prep. Moreover, the work can vary from making the meal in its entirety, to simply measuring and preparing the ingredients you know you will need throughout the week. Look into a few different systems to see which style is best for you.", "author": 1, "created_on": "2022-06-02T18:54:31.796Z"}}, {"model": "blog.post", "pk": 3, "fields": {"title": "Exercise Daily", "slug": "exercise-daily", "updated_on": "2022-06-02T18:56:43.681Z", "content": "Our bodies need movement, especially when we are at our most stressed. You don’t necessarily need to do intense, prolonged exercise every day. In fact, walking for half an hour each morning can make a massive difference in both physical and mental health. Consider adding a 30-minute walk around the neighborhood into your morning routine. \r\n\r\nThis simple act can go a long way when it comes to reducing stress. When we don’t get enough exercise, our bodies start to build up stress hormones, making us irritable, restless, and inattentive. This makes it harder to focus and achieve your goals, which in turn creates more stress. Exercising breaks this cycle, allowing our body to let go of some of those stress hormones and find balance.", "author": 1, "created_on": "2022-06-02T18:56:43.681Z"}}, {"model": "blog.post", "pk": 4, "fields": {"title": "Drink More Water", "slug": "drink-more-water", "updated_on": "2022-06-02T18:57:24.501Z", "content": "Last but not least, consider finding ways to commit to proper hydration. Most adults need at least 11 cups of water a day - or more - in order to be fully hydrated. Although this transition can leave you rushing to the bathroom more often for the first couple of weeks, your body will adjust. Once it does, you will feel healthier, more energized, and ready to take on the day. \r\n\r\nAs we said above, these are just a few of the tools you can use to create a sustainable self-care routine. Focus on building habits you can fit into your everyday schedule in order to give yourself the best chance at sticking with your goals long-term. This way, you will give yourself the care and energy you need to build a business you can be proud of!", "author": 1, "created_on": "2022-06-02T18:57:24.501Z"}}]